pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_IR_Bits.PED */
#define IFX_CAN_N_IR_PED_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.PED */
#define IFX_CAN_N_IR_PED_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.PED */
#define IFX_CAN_N_IR_PED_OFF (28u)

/** \brief Length for Ifx_CAN_N_IE_Bits.RF0NE */
#define IFX_CAN_N_IE_RF0NE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.RF0NE */
#define IFX_CAN_N_IE_RF0NE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.RF0NE */
#define IFX_CAN_N_IE_RF0NE_OFF (0u)

/** \brief Length for Ifx_CAN_N_IE_Bits.RF0WE */
#define IFX_CAN_N_IE_RF0WE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.RF0WE */
#define IFX_CAN_N_IE_RF0WE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.RF0WE */
#define IFX_CAN_N_IE_RF0WE_OFF (1u)

/** \brief Length for Ifx_CAN_N_IE_Bits.RF0FE */
#define IFX_CAN_N_IE_RF0FE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.RF0FE */
#define IFX_CAN_N_IE_RF0FE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.RF0FE */
#define IFX_CAN_N_IE_RF0FE_OFF (2u)

/** \brief Length for Ifx_CAN_N_IE_Bits.RF0LE */
#define IFX_CAN_N_IE_RF0LE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.RF0LE */
#define IFX_CAN_N_IE_RF0LE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.RF0LE */
#define IFX_CAN_N_IE_RF0LE_OFF (3u)

/** \brief Length for Ifx_CAN_N_IE_Bits.RF1NE */
#define IFX_CAN_N_IE_RF1NE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.RF1NE */
#define IFX_CAN_N_IE_RF1NE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.RF1NE */
#define IFX_CAN_N_IE_RF1NE_OFF (4u)

/** \brief Length for Ifx_CAN_N_IE_Bits.RF1WE */
#define IFX_CAN_N_IE_RF1WE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.RF1WE */
#define IFX_CAN_N_IE_RF1WE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.RF1WE */
#define IFX_CAN_N_IE_RF1WE_OFF (5u)

/** \brief Length for Ifx_CAN_N_IE_Bits.RF1FE */
#define IFX_CAN_N_IE_RF1FE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.RF1FE */
#define IFX_CAN_N_IE_RF1FE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.RF1FE */
#define IFX_CAN_N_IE_RF1FE_OFF (6u)

/** \brief Length for Ifx_CAN_N_IE_Bits.RF1LE */
#define IFX_CAN_N_IE_RF1LE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.RF1LE */
#define IFX_CAN_N_IE_RF1LE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.RF1LE */
#define IFX_CAN_N_IE_RF1LE_OFF (7u)

/** \brief Length for Ifx_CAN_N_IE_Bits.HPME */
#define IFX_CAN_N_IE_HPME_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.HPME */
#define IFX_CAN_N_IE_HPME_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.HPME */
#define IFX_CAN_N_IE_HPME_OFF (8u)

/** \brief Length for Ifx_CAN_N_IE_Bits.TCE */
#define IFX_CAN_N_IE_TCE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.TCE */
#define IFX_CAN_N_IE_TCE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.TCE */
#define IFX_CAN_N_IE_TCE_OFF (9u)

/** \brief Length for Ifx_CAN_N_IE_Bits.TCFE */
#define IFX_CAN_N_IE_TCFE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.TCFE */
#define IFX_CAN_N_IE_TCFE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.TCFE */
#define IFX_CAN_N_IE_TCFE_OFF (10u)

/** \brief Length for Ifx_CAN_N_IE_Bits.TFEE */
#define IFX_CAN_N_IE_TFEE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.TFEE */
#define IFX_CAN_N_IE_TFEE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.TFEE */
#define IFX_CAN_N_IE_TFEE_OFF (11u)

/** \brief Length for Ifx_CAN_N_IE_Bits.TEFNE */
#define IFX_CAN_N_IE_TEFNE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.TEFNE */
#define IFX_CAN_N_IE_TEFNE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.TEFNE */
#define IFX_CAN_N_IE_TEFNE_OFF (12u)

/** \brief Length for Ifx_CAN_N_IE_Bits.TEFWE */
#define IFX_CAN_N_IE_TEFWE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.TEFWE */
#define IFX_CAN_N_IE_TEFWE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.TEFWE */
#define IFX_CAN_N_IE_TEFWE_OFF (13u)

/** \brief Length for Ifx_CAN_N_IE_Bits.TEFFE */
#define IFX_CAN_N_IE_TEFFE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.TEFFE */
#define IFX_CAN_N_IE_TEFFE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.TEFFE */
#define IFX_CAN_N_IE_TEFFE_OFF (14u)

/** \brief Length for Ifx_CAN_N_IE_Bits.TEFLE */
#define IFX_CAN_N_IE_TEFLE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.TEFLE */
#define IFX_CAN_N_IE_TEFLE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.TEFLE */
#define IFX_CAN_N_IE_TEFLE_OFF (15u)

/** \brief Length for Ifx_CAN_N_IE_Bits.TSWE */
#define IFX_CAN_N_IE_TSWE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.TSWE */
#define IFX_CAN_N_IE_TSWE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.TSWE */
#define IFX_CAN_N_IE_TSWE_OFF (16u)

/** \brief Length for Ifx_CAN_N_IE_Bits.MRAFE */
#define IFX_CAN_N_IE_MRAFE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.MRAFE */
#define IFX_CAN_N_IE_MRAFE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.MRAFE */
#define IFX_CAN_N_IE_MRAFE_OFF (17u)

/** \brief Length for Ifx_CAN_N_IE_Bits.TOOE */
#define IFX_CAN_N_IE_TOOE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.TOOE */
#define IFX_CAN_N_IE_TOOE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.TOOE */
#define IFX_CAN_N_IE_TOOE_OFF (18u)

/** \brief Length for Ifx_CAN_N_IE_Bits.DRXE */
#define IFX_CAN_N_IE_DRXE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.DRXE */
#define IFX_CAN_N_IE_DRXE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.DRXE */
#define IFX_CAN_N_IE_DRXE_OFF (19u)

/** \brief Length for Ifx_CAN_N_IE_Bits.ELOE */
#define IFX_CAN_N_IE_ELOE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.ELOE */
#define IFX_CAN_N_IE_ELOE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.ELOE */
#define IFX_CAN_N_IE_ELOE_OFF (22u)

/** \brief Length for Ifx_CAN_N_IE_Bits.EPE */
#define IFX_CAN_N_IE_EPE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.EPE */
#define IFX_CAN_N_IE_EPE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.EPE */
#define IFX_CAN_N_IE_EPE_OFF (23u)

/** \brief Length for Ifx_CAN_N_IE_Bits.EWE */
#define IFX_CAN_N_IE_EWE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.EWE */
#define IFX_CAN_N_IE_EWE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.EWE */
#define IFX_CAN_N_IE_EWE_OFF (24u)

/** \brief Length for Ifx_CAN_N_IE_Bits.BOE */
#define IFX_CAN_N_IE_BOE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.BOE */
#define IFX_CAN_N_IE_BOE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.BOE */
#define IFX_CAN_N_IE_BOE_OFF (25u)

/** \brief Length for Ifx_CAN_N_IE_Bits.WDIE */
#define IFX_CAN_N_IE_WDIE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.WDIE */
#define IFX_CAN_N_IE_WDIE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.WDIE */
#define IFX_CAN_N_IE_WDIE_OFF (26u)

