pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR10 */
#define IFX_CAN_N_TX_BCR_CR10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR11 */
#define IFX_CAN_N_TX_BCR_CR11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR11 */
#define IFX_CAN_N_TX_BCR_CR11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR11 */
#define IFX_CAN_N_TX_BCR_CR11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR12 */
#define IFX_CAN_N_TX_BCR_CR12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR12 */
#define IFX_CAN_N_TX_BCR_CR12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR12 */
#define IFX_CAN_N_TX_BCR_CR12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR13 */
#define IFX_CAN_N_TX_BCR_CR13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR13 */
#define IFX_CAN_N_TX_BCR_CR13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR13 */
#define IFX_CAN_N_TX_BCR_CR13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR14 */
#define IFX_CAN_N_TX_BCR_CR14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR14 */
#define IFX_CAN_N_TX_BCR_CR14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR14 */
#define IFX_CAN_N_TX_BCR_CR14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR15 */
#define IFX_CAN_N_TX_BCR_CR15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR15 */
#define IFX_CAN_N_TX_BCR_CR15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR15 */
#define IFX_CAN_N_TX_BCR_CR15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR16 */
#define IFX_CAN_N_TX_BCR_CR16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR16 */
#define IFX_CAN_N_TX_BCR_CR16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR16 */
#define IFX_CAN_N_TX_BCR_CR16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR17 */
#define IFX_CAN_N_TX_BCR_CR17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR17 */
#define IFX_CAN_N_TX_BCR_CR17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR17 */
#define IFX_CAN_N_TX_BCR_CR17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR18 */
#define IFX_CAN_N_TX_BCR_CR18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR18 */
#define IFX_CAN_N_TX_BCR_CR18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR18 */
#define IFX_CAN_N_TX_BCR_CR18_OFF (18u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR19 */
#define IFX_CAN_N_TX_BCR_CR19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR19 */
#define IFX_CAN_N_TX_BCR_CR19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR19 */
#define IFX_CAN_N_TX_BCR_CR19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR20 */
#define IFX_CAN_N_TX_BCR_CR20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR20 */
#define IFX_CAN_N_TX_BCR_CR20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR20 */
#define IFX_CAN_N_TX_BCR_CR20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR21 */
#define IFX_CAN_N_TX_BCR_CR21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR21 */
#define IFX_CAN_N_TX_BCR_CR21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR21 */
#define IFX_CAN_N_TX_BCR_CR21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR22 */
#define IFX_CAN_N_TX_BCR_CR22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR22 */
#define IFX_CAN_N_TX_BCR_CR22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR22 */
#define IFX_CAN_N_TX_BCR_CR22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR23 */
#define IFX_CAN_N_TX_BCR_CR23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR23 */
#define IFX_CAN_N_TX_BCR_CR23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR23 */
#define IFX_CAN_N_TX_BCR_CR23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR24 */
#define IFX_CAN_N_TX_BCR_CR24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR24 */
#define IFX_CAN_N_TX_BCR_CR24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR24 */
#define IFX_CAN_N_TX_BCR_CR24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR25 */
#define IFX_CAN_N_TX_BCR_CR25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR25 */
#define IFX_CAN_N_TX_BCR_CR25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR25 */
#define IFX_CAN_N_TX_BCR_CR25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR26 */
#define IFX_CAN_N_TX_BCR_CR26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR26 */
#define IFX_CAN_N_TX_BCR_CR26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR26 */
#define IFX_CAN_N_TX_BCR_CR26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR27 */
#define IFX_CAN_N_TX_BCR_CR27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR27 */
#define IFX_CAN_N_TX_BCR_CR27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR27 */
#define IFX_CAN_N_TX_BCR_CR27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR28 */
#define IFX_CAN_N_TX_BCR_CR28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR28 */
#define IFX_CAN_N_TX_BCR_CR28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR28 */
#define IFX_CAN_N_TX_BCR_CR28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR29 */
#define IFX_CAN_N_TX_BCR_CR29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR29 */
#define IFX_CAN_N_TX_BCR_CR29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR29 */
#define IFX_CAN_N_TX_BCR_CR29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR30 */
#define IFX_CAN_N_TX_BCR_CR30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR30 */
#define IFX_CAN_N_TX_BCR_CR30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR30 */
#define IFX_CAN_N_TX_BCR_CR30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR31 */
#define IFX_CAN_N_TX_BCR_CR31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR31 */
#define IFX_CAN_N_TX_BCR_CR31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR31 */
#define IFX_CAN_N_TX_BCR_CR31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO0 */
#define IFX_CAN_N_TX_BTO_TO0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO0 */
#define IFX_CAN_N_TX_BTO_TO0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO0 */
#define IFX_CAN_N_TX_BTO_TO0_OFF (0u)

